app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def edit
    @article = Article.find_by(params[:id])